app/controllers/carts_controller.rb

  def show
    begin
      @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE ("carts"."id" = 4) LIMIT 1

  def edit
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE ("carts"."id" = 1) LIMIT 1

  def update
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE ("carts"."id" = 4) LIMIT 1

  def destroy
    @cart = current_cart
    @cart.destroy
---
DELETE FROM "carts" WHERE ("carts"."id" = 2)