app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-16 10:42:59.000000', '2011-05-16 10:42:59.000000')