app/controllers/line_items_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-16 10:43:00.083678', '2011-05-16 10:43:00.083678')
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save