app/controllers/orders_controller.rb

  def index
#    @orders = Order.all
     @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
:per_page => 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def show
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE ("orders"."id" = 1) LIMIT 1

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 31)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 31)

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-16 04:41:17.332375', '2011-05-16 04:41:17.332375')
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ('acd dd', 'dda', 'acc@ddd.com', 'Check', '2011-05-16 03:54:07.977640', '2011-05-16 03:54:07.977640')
DELETE FROM "carts" WHERE ("carts"."id" = 31)
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 2)