app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE ("products"."id" = 3) ORDER BY title LIMIT 1

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE ("products"."id" = 3) ORDER BY title LIMIT 1

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ('A test', 'a test', '/images/rails.png', 10.0, '2011-05-16 15:14:06.444810', '2011-05-16 15:14:06.444810')