app/controllers/store_controller.rb

  def index
    if params[:set_locale]
       redirect_to store_path(:locale => params[:set_locale])
    else
	    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY title