app/controllers/users_controller.rb

INSERT INTO "users" ("name", "hashed_password", "salt", "created_at", "updated_at") VALUES ('abcdef', 'abcdef', 'acdd', '2011-05-16 04:35:20.959982', '2011-05-16 04:35:20.959982')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save